{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "Lowercase"
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Sequence",
    "pretokenizers": [
      {
        "type": "Whitespace"
      },
      {
        "type": "Split",
        "pattern": {
          "String": "(\\[[A-Z0-9_]+\\])|(0x[0-9A-Fa-f]+)|(\\d+)|([A-Za-z_][A-Za-z0-9_]*(?:\\.[A-Za-z0-9_]+)*)|([()=/*+,;-])"
        },
        "behavior": "Isolated",
        "invert": false
      }
    ]
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "[CLS]": 2,
      "[SEP]": 3,
      "[MASK]": 4,
      "$": 5,
      "'": 6,
      "(": 7,
      ")": 8,
      "*": 9,
      "+": 10,
      ",": 11,
      ".": 12,
      "0": 13,
      "1": 14,
      "2": 15,
      "3": 16,
      "4": 17,
      "5": 18,
      "6": 19,
      "7": 20,
      "8": 21,
      "9": 22,
      ":": 23,
      ";": 24,
      "=": 25,
      ">": 26,
      "@": 27,
      "[": 28,
      "\\": 29,
      "]": 30,
      "_": 31,
      "a": 32,
      "b": 33,
      "c": 34,
      "d": 35,
      "e": 36,
      "f": 37,
      "g": 38,
      "h": 39,
      "i": 40,
      "j": 41,
      "k": 42,
      "l": 43,
      "m": 44,
      "n": 45,
      "o": 46,
      "p": 47,
      "q": 48,
      "r": 49,
      "s": 50,
      "t": 51,
      "u": 52,
      "v": 53,
      "w": 54,
      "x": 55,
      "y": 56,
      "|": 57,
      "~": 58,
      "el": 59,
      "nd": 60,
      "and": 61,
      "rand": 62,
      "um": 63,
      "num": 64,
      "randnum": 65,
      "er": 66,
      "st": 67,
      "))": 68,
      "it": 69,
      "ct": 70,
      "im": 71,
      "imit": 72,
      "'[": 73,
      "]'": 74,
      "_st": 75,
      "del": 76,
      "er_st": 77,
      "imiter_st": 78,
      "delimiter_st": 79,
      "ect": 80,
      "sel": 81,
      "select": 82,
      "se": 83,
      "]=": 84,
      "he": 85,
      "ca": 86,
      "hen": 87,
      "ar": 88,
      "([": 89,
      "op": 90,
      "delimiter_star": 91,
      "delimiter_stop": 92,
      "delimiter_start": 93,
      "||": 94,
      "]=[": 95,
      "ro": 96,
      "on": 97,
      "]',": 98,
      "('[": 99,
      "),": 100,
      "])": 101,
      "],": 102,
      "fro": 103,
      "from": 104,
      "con": 105,
      "end": 106,
      "then": 107,
      "when": 108,
      "else": 109,
      "case": 110,
      "cat": 111,
      "]',(": 112,
      "concat": 113,
      "or": 114,
      "]'||": 115,
      "||'[": 116,
      "in": 117,
      "elt": 118,
      "))),": 119,
      "))),'[": 120,
      "]'||(": 121,
      ")||'[": 122,
      "]'))": 123,
      "un": 124,
      "al": 125,
      "ex": 126,
      ",'[": 127,
      "('": 128,
      "up": 129,
      "44": 130,
      "co": 131,
      "]')": 132,
      "at": 133,
      "ch": 134,
      "du": 135,
      ",(": 136,
      "ion": 137,
      "ys": 138,
      "dual": 139,
      "','[": 140,
      "_s": 141,
      "'))": 142,
      "((": 143,
      "70": 144,
      ")))": 145,
      "unt": 146,
      "count": 147,
      "chr": 148,
      "ext": 149,
      "as": 150,
      "sys": 151,
      "eri": 152,
      ")*": 153,
      "by": 154,
      "fl": 155,
      "gro": 156,
      "oor": 157,
      "ra": 158,
      "ing": 159,
      "union": 160,
      "floor": 161,
      "group": 162,
      "(*": 163,
      "+(": 164,
      "+'[": 165,
      "07": 166,
      "10": 167,
      "16": 168,
      "370": 169,
      "55": 170,
      "67": 171,
      "844": 172,
      "955": 173,
      "::": 174,
      "bit": 175,
      "dat": 176,
      "ml": 177,
      "ut": 178,
      "ver": 179,
      "numeri": 180,
      "))+'[": 181,
      "]'),": 182,
      "]'+(": 183,
      "]=('[": 184,
      "cast": 185,
      "]','": 186,
      "conver": 187,
      "4407": 188,
      "(*),": 189,
      "1610": 190,
      "370955": 191,
      "674407": 192,
      "844674407": 193,
      "numeric": 194,
      "]'),[": 195,
      "convert": 196,
      "3709551610": 197,
      "8446744073709551610": 198,
      "randnum1": 199,
      "str": 200,
      "00": 201,
      "_t": 202,
      "bm": 203,
      "dr": 204,
      "id": 205,
      "text": 206,
      "erro": 207,
      ")),'[": 208,
      "))::": 209,
      "_to": 210,
      "error": 211,
      "\\','[": 212,
      "che": 213,
      "de": 214,
      "for": 215,
      "gin": 216,
      "lu": 217,
      "ma": 218,
      "mat": 219,
      "plu": 220,
      "ue": 221,
      "val": 222,
      "ctval": 223,
      "set": 224,
      "],[": 225,
      "infor": 226,
      "('\\','[": 227,
      "ion_s": 228,
      "extra": 229,
      "chema": 230,
      "gins": 231,
      "mation_s": 232,
      "plugins": 233,
      "ctvalue": 234,
      "information_s": 235,
      "extractvalue": 236,
      "information_schema": 237,
      "(~": 238,
      ")||": 239,
      "*(": 240,
      ".','[": 241,
      "58": 242,
      "60": 243,
      "62": 244,
      "_b": 245,
      "_k": 246,
      "_error": 247,
      "ab": 248,
      "ad": 249,
      "ase": 250,
      "bset": 251,
      "db": 252,
      "dum": 253,
      "es": 254,
      "eys": 255,
      "f8": 256,
      "ge": 257,
      "gt": 258,
      "if": 259,
      "ise": 260,
      "ibm": 261,
      "js": 262,
      "my": 263,
      "pe": 264,
      "per": 265,
      "ql": 266,
      "rdb": 267,
      "sing": 268,
      "ty": 269,
      "ubset": 270,
      "using": 271,
      "xml": 272,
      "ary": 273,
      "on_k": 274,
      "int": 275,
      "inary": 276,
      "exp": 277,
      "exml": 278,
      "('.','[": 279,
      "updat": 280,
      "upper": 281,
      "code": 282,
      "_subset": 283,
      "7000": 284,
      "sysdum": 285,
      "sysibm": 286,
      "raise": 287,
      "ing_to": 288,
      "bitcount": 289,
      "bitstr": 290,
      "datab": 291,
      "utf8": 292,
      "id_subset": 293,
      "(~(": 294,
      "_binary": 295,
      "addr": 296,
      "gtid_subset": 297,
      "json_k": 298,
      "my1": 299,
      "type": 300,
      "xmltype": 301,
      "updatexml": 302,
      "70001": 303,
      "sysdummy1": 304,
      "raise_error": 305,
      "ing_to_binary": 306,
      "bitstring_to_binary": 307,
      "database": 308,
      "json_keys": 309,
      ">(": 310,
      "@[": 311,
      "var": 312,
      "randstr": 313,
      "randnum2": 314,
      "randnum3": 315,
      "randnum4": 316,
      "randnum5": 317,
      "]=(": 318,
      "row": 319,
      "])>(": 320,
      "]')))": 321,
      "char": 322,
      "varchar": 323,
      "(('[": 324,
      ")::": 325,
      "48": 326,
      "49": 327,
      "_h": 328,
      "_in": 329,
      "_ut": 330,
      "_addr": 331,
      "dbm": 332,
      "e_s": 333,
      "hs": 334,
      "has": 335,
      "il": 336,
      "is": 337,
      "ll": 338,
      "limit": 339,
      "l_in": 340,
      "no": 341,
      "nu": 342,
      "ner": 343,
      "ost": 344,
      "sn": 345,
      "sql": 346,
      "s_ut": 347,
      "t_h": 348,
      "xsys": 349,
      "ity": 350,
      "iths": 351,
      "ctxsys": 352,
      "],('[": 353,
      "ate_s": 354,
      "_sql": 355,
      "eries": 356,
      "utl_in": 357,
      "driths": 358,
      "id_to": 359,
      "ess": 360,
      "gener": 361,
      "get_h": 362,
      "_address": 363,
      "dbms_ut": 364,
      "hash": 365,
      "ility": 366,
      "not": 367,
      "null": 368,
      "ost_address": 369,
      "sqlid_to": 370,
      "ate_series": 371,
      "_sqlhash": 372,
      "utl_inaddr": 373,
      "drithsx": 374,
      "generate_series": 375,
      "get_host_address": 376,
      "dbms_utility": 377,
      "sqlid_to_sqlhash": 378
    },
    "merges": [
      [
        "e",
        "l"
      ],
      [
        "n",
        "d"
      ],
      [
        "a",
        "nd"
      ],
      [
        "r",
        "and"
      ],
      [
        "u",
        "m"
      ],
      [
        "n",
        "um"
      ],
      [
        "rand",
        "num"
      ],
      [
        "e",
        "r"
      ],
      [
        "s",
        "t"
      ],
      [
        ")",
        ")"
      ],
      [
        "i",
        "t"
      ],
      [
        "c",
        "t"
      ],
      [
        "i",
        "m"
      ],
      [
        "im",
        "it"
      ],
      [
        "'",
        "["
      ],
      [
        "]",
        "'"
      ],
      [
        "_",
        "st"
      ],
      [
        "d",
        "el"
      ],
      [
        "er",
        "_st"
      ],
      [
        "imit",
        "er_st"
      ],
      [
        "del",
        "imiter_st"
      ],
      [
        "e",
        "ct"
      ],
      [
        "s",
        "el"
      ],
      [
        "sel",
        "ect"
      ],
      [
        "s",
        "e"
      ],
      [
        "]",
        "="
      ],
      [
        "h",
        "e"
      ],
      [
        "c",
        "a"
      ],
      [
        "he",
        "n"
      ],
      [
        "a",
        "r"
      ],
      [
        "(",
        "["
      ],
      [
        "o",
        "p"
      ],
      [
        "delimiter_st",
        "ar"
      ],
      [
        "delimiter_st",
        "op"
      ],
      [
        "delimiter_star",
        "t"
      ],
      [
        "|",
        "|"
      ],
      [
        "]=",
        "["
      ],
      [
        "r",
        "o"
      ],
      [
        "o",
        "n"
      ],
      [
        "]'",
        ","
      ],
      [
        "(",
        "'["
      ],
      [
        ")",
        ","
      ],
      [
        "]",
        ")"
      ],
      [
        "]",
        ","
      ],
      [
        "f",
        "ro"
      ],
      [
        "fro",
        "m"
      ],
      [
        "c",
        "on"
      ],
      [
        "e",
        "nd"
      ],
      [
        "t",
        "hen"
      ],
      [
        "w",
        "hen"
      ],
      [
        "el",
        "se"
      ],
      [
        "ca",
        "se"
      ],
      [
        "ca",
        "t"
      ],
      [
        "]',",
        "("
      ],
      [
        "con",
        "cat"
      ],
      [
        "o",
        "r"
      ],
      [
        "]'",
        "||"
      ],
      [
        "||",
        "'["
      ],
      [
        "i",
        "n"
      ],
      [
        "el",
        "t"
      ],
      [
        "))",
        "),"
      ],
      [
        "))),",
        "'["
      ],
      [
        "]'||",
        "("
      ],
      [
        ")",
        "||'["
      ],
      [
        "]'",
        "))"
      ],
      [
        "u",
        "n"
      ],
      [
        "a",
        "l"
      ],
      [
        "e",
        "x"
      ],
      [
        ",",
        "'["
      ],
      [
        "(",
        "'"
      ],
      [
        "u",
        "p"
      ],
      [
        "4",
        "4"
      ],
      [
        "c",
        "o"
      ],
      [
        "]'",
        ")"
      ],
      [
        "a",
        "t"
      ],
      [
        "c",
        "h"
      ],
      [
        "d",
        "u"
      ],
      [
        ",",
        "("
      ],
      [
        "i",
        "on"
      ],
      [
        "y",
        "s"
      ],
      [
        "du",
        "al"
      ],
      [
        "'",
        ",'["
      ],
      [
        "_",
        "s"
      ],
      [
        "'",
        "))"
      ],
      [
        "(",
        "("
      ],
      [
        "7",
        "0"
      ],
      [
        "))",
        ")"
      ],
      [
        "un",
        "t"
      ],
      [
        "co",
        "unt"
      ],
      [
        "ch",
        "r"
      ],
      [
        "ex",
        "t"
      ],
      [
        "a",
        "s"
      ],
      [
        "s",
        "ys"
      ],
      [
        "er",
        "i"
      ],
      [
        ")",
        "*"
      ],
      [
        "b",
        "y"
      ],
      [
        "f",
        "l"
      ],
      [
        "g",
        "ro"
      ],
      [
        "o",
        "or"
      ],
      [
        "r",
        "a"
      ],
      [
        "in",
        "g"
      ],
      [
        "un",
        "ion"
      ],
      [
        "fl",
        "oor"
      ],
      [
        "gro",
        "up"
      ],
      [
        "(",
        "*"
      ],
      [
        "+",
        "("
      ],
      [
        "+",
        "'["
      ],
      [
        "0",
        "7"
      ],
      [
        "1",
        "0"
      ],
      [
        "1",
        "6"
      ],
      [
        "3",
        "70"
      ],
      [
        "5",
        "5"
      ],
      [
        "6",
        "7"
      ],
      [
        "8",
        "44"
      ],
      [
        "9",
        "55"
      ],
      [
        ":",
        ":"
      ],
      [
        "b",
        "it"
      ],
      [
        "d",
        "at"
      ],
      [
        "m",
        "l"
      ],
      [
        "u",
        "t"
      ],
      [
        "v",
        "er"
      ],
      [
        "num",
        "eri"
      ],
      [
        "))",
        "+'["
      ],
      [
        "]'",
        "),"
      ],
      [
        "]'",
        "+("
      ],
      [
        "]=",
        "('["
      ],
      [
        "ca",
        "st"
      ],
      [
        "]',",
        "'"
      ],
      [
        "con",
        "ver"
      ],
      [
        "44",
        "07"
      ],
      [
        "(*",
        "),"
      ],
      [
        "16",
        "10"
      ],
      [
        "370",
        "955"
      ],
      [
        "67",
        "4407"
      ],
      [
        "844",
        "674407"
      ],
      [
        "numeri",
        "c"
      ],
      [
        "]'),",
        "["
      ],
      [
        "conver",
        "t"
      ],
      [
        "370955",
        "1610"
      ],
      [
        "844674407",
        "3709551610"
      ],
      [
        "randnum",
        "1"
      ],
      [
        "st",
        "r"
      ],
      [
        "0",
        "0"
      ],
      [
        "_",
        "t"
      ],
      [
        "b",
        "m"
      ],
      [
        "d",
        "r"
      ],
      [
        "i",
        "d"
      ],
      [
        "t",
        "ext"
      ],
      [
        "er",
        "ro"
      ],
      [
        "))",
        ",'["
      ],
      [
        "))",
        "::"
      ],
      [
        "_t",
        "o"
      ],
      [
        "erro",
        "r"
      ],
      [
        "\\",
        "','["
      ],
      [
        "c",
        "he"
      ],
      [
        "d",
        "e"
      ],
      [
        "f",
        "or"
      ],
      [
        "g",
        "in"
      ],
      [
        "l",
        "u"
      ],
      [
        "m",
        "a"
      ],
      [
        "m",
        "at"
      ],
      [
        "p",
        "lu"
      ],
      [
        "u",
        "e"
      ],
      [
        "v",
        "al"
      ],
      [
        "ct",
        "val"
      ],
      [
        "se",
        "t"
      ],
      [
        "],",
        "["
      ],
      [
        "in",
        "for"
      ],
      [
        "('",
        "\\','["
      ],
      [
        "ion",
        "_s"
      ],
      [
        "ext",
        "ra"
      ],
      [
        "che",
        "ma"
      ],
      [
        "gin",
        "s"
      ],
      [
        "mat",
        "ion_s"
      ],
      [
        "plu",
        "gins"
      ],
      [
        "ctval",
        "ue"
      ],
      [
        "infor",
        "mation_s"
      ],
      [
        "extra",
        "ctvalue"
      ],
      [
        "information_s",
        "chema"
      ],
      [
        "(",
        "~"
      ],
      [
        ")",
        "||"
      ],
      [
        "*",
        "("
      ],
      [
        ".",
        "','["
      ],
      [
        "5",
        "8"
      ],
      [
        "6",
        "0"
      ],
      [
        "6",
        "2"
      ],
      [
        "_",
        "b"
      ],
      [
        "_",
        "k"
      ],
      [
        "_",
        "error"
      ],
      [
        "a",
        "b"
      ],
      [
        "a",
        "d"
      ],
      [
        "a",
        "se"
      ],
      [
        "b",
        "set"
      ],
      [
        "d",
        "b"
      ],
      [
        "d",
        "um"
      ],
      [
        "e",
        "s"
      ],
      [
        "e",
        "ys"
      ],
      [
        "f",
        "8"
      ],
      [
        "g",
        "e"
      ],
      [
        "g",
        "t"
      ],
      [
        "i",
        "f"
      ],
      [
        "i",
        "se"
      ],
      [
        "i",
        "bm"
      ],
      [
        "j",
        "s"
      ],
      [
        "m",
        "y"
      ],
      [
        "p",
        "e"
      ],
      [
        "p",
        "er"
      ],
      [
        "q",
        "l"
      ],
      [
        "r",
        "db"
      ],
      [
        "s",
        "ing"
      ],
      [
        "t",
        "y"
      ],
      [
        "u",
        "bset"
      ],
      [
        "u",
        "sing"
      ],
      [
        "x",
        "ml"
      ],
      [
        "ar",
        "y"
      ],
      [
        "on",
        "_k"
      ],
      [
        "in",
        "t"
      ],
      [
        "in",
        "ary"
      ],
      [
        "ex",
        "p"
      ],
      [
        "ex",
        "ml"
      ],
      [
        "('",
        ".','["
      ],
      [
        "up",
        "dat"
      ],
      [
        "up",
        "per"
      ],
      [
        "co",
        "de"
      ],
      [
        "_s",
        "ubset"
      ],
      [
        "70",
        "00"
      ],
      [
        "sys",
        "dum"
      ],
      [
        "sys",
        "ibm"
      ],
      [
        "ra",
        "ise"
      ],
      [
        "ing",
        "_to"
      ],
      [
        "bit",
        "count"
      ],
      [
        "bit",
        "str"
      ],
      [
        "dat",
        "ab"
      ],
      [
        "ut",
        "f8"
      ],
      [
        "id",
        "_subset"
      ],
      [
        "(~",
        "("
      ],
      [
        "_b",
        "inary"
      ],
      [
        "ad",
        "dr"
      ],
      [
        "gt",
        "id_subset"
      ],
      [
        "js",
        "on_k"
      ],
      [
        "my",
        "1"
      ],
      [
        "ty",
        "pe"
      ],
      [
        "xml",
        "type"
      ],
      [
        "updat",
        "exml"
      ],
      [
        "7000",
        "1"
      ],
      [
        "sysdum",
        "my1"
      ],
      [
        "raise",
        "_error"
      ],
      [
        "ing_to",
        "_binary"
      ],
      [
        "bitstr",
        "ing_to_binary"
      ],
      [
        "datab",
        "ase"
      ],
      [
        "json_k",
        "eys"
      ],
      [
        ">",
        "("
      ],
      [
        "@",
        "["
      ],
      [
        "v",
        "ar"
      ],
      [
        "rand",
        "str"
      ],
      [
        "randnum",
        "2"
      ],
      [
        "randnum",
        "3"
      ],
      [
        "randnum",
        "4"
      ],
      [
        "randnum",
        "5"
      ],
      [
        "]=",
        "("
      ],
      [
        "ro",
        "w"
      ],
      [
        "])",
        ">("
      ],
      [
        "]'))",
        ")"
      ],
      [
        "ch",
        "ar"
      ],
      [
        "var",
        "char"
      ],
      [
        "(",
        "('["
      ],
      [
        ")",
        "::"
      ],
      [
        "4",
        "8"
      ],
      [
        "4",
        "9"
      ],
      [
        "_",
        "h"
      ],
      [
        "_",
        "in"
      ],
      [
        "_",
        "ut"
      ],
      [
        "_",
        "addr"
      ],
      [
        "d",
        "bm"
      ],
      [
        "e",
        "_s"
      ],
      [
        "h",
        "s"
      ],
      [
        "h",
        "as"
      ],
      [
        "i",
        "l"
      ],
      [
        "i",
        "s"
      ],
      [
        "l",
        "l"
      ],
      [
        "l",
        "imit"
      ],
      [
        "l",
        "_in"
      ],
      [
        "n",
        "o"
      ],
      [
        "n",
        "u"
      ],
      [
        "n",
        "er"
      ],
      [
        "o",
        "st"
      ],
      [
        "s",
        "n"
      ],
      [
        "s",
        "ql"
      ],
      [
        "s",
        "_ut"
      ],
      [
        "t",
        "_h"
      ],
      [
        "x",
        "sys"
      ],
      [
        "it",
        "y"
      ],
      [
        "it",
        "hs"
      ],
      [
        "ct",
        "xsys"
      ],
      [
        "],",
        "('["
      ],
      [
        "at",
        "e_s"
      ],
      [
        "_s",
        "ql"
      ],
      [
        "eri",
        "es"
      ],
      [
        "ut",
        "l_in"
      ],
      [
        "dr",
        "iths"
      ],
      [
        "id",
        "_to"
      ],
      [
        "es",
        "s"
      ],
      [
        "ge",
        "ner"
      ],
      [
        "ge",
        "t_h"
      ],
      [
        "_addr",
        "ess"
      ],
      [
        "dbm",
        "s_ut"
      ],
      [
        "has",
        "h"
      ],
      [
        "il",
        "ity"
      ],
      [
        "no",
        "t"
      ],
      [
        "nu",
        "ll"
      ],
      [
        "ost",
        "_address"
      ],
      [
        "sql",
        "id_to"
      ],
      [
        "ate_s",
        "eries"
      ],
      [
        "_sql",
        "hash"
      ],
      [
        "utl_in",
        "addr"
      ],
      [
        "driths",
        "x"
      ],
      [
        "gener",
        "ate_series"
      ],
      [
        "get_h",
        "ost_address"
      ],
      [
        "dbms_ut",
        "ility"
      ],
      [
        "sqlid_to",
        "_sqlhash"
      ]
    ]
  }
}